"""Задание: Напишите программу, которая запрашивает у пользователя два числа: высоту и
ширину. Затем программа должна "нарисовать" в консоли прямоугольник из звездочек (*)
указанного размера.
Подсказка:
● Внешний цикл будет отвечать за количество строк (высоту).
● Внутренний цикл будет в каждой строке выводить нужное количество звездочек
(ширину)."""
user_length: int = int(input("Enter the length of the rectangle: "))
user_width: int = int(input("Enter the width of the rectangle: "))
# Мой вариант:
for i in range(user_length):
    print(f"{'*' * user_width}")
