"""Задание: У вас есть список с баллами студентов. Вам нужно посчитать сумму баллов, но
с особыми правилами:
● Если балл отрицательный (< 0), его нужно проигнорировать и перейти к
следующему.
● Если встречается балл 0, это сигнал, что список данных обрывается, и нужно
немедленно прекратить подсчет.
● Если цикл прошел через все баллы и не был прерван (т.е. не встретил 0), нужно
вывести сообщение, что все данные были обработаны корректно.
Используйте break, continue или else для выполнения условий."""
scores: list[int] = [75, 88, -10, 95, 100, -25, 89]
total_score: int = 0

for score in scores:
    if score < 0:
        continue
    elif score == 0:
        print(f"Processing interrupted!! Total score: {total_score}")
        break
    total_score += score
else:
    print(f"Total score: {total_score}")
