# Описание задания: Напишите программу, которая сначала спрашивает у
# пользователя его имя, а затем выводит персональное приветствие,
# используя это имя.

user_name = input("What's your name? ")
print(f"Hello, {user_name}! Nice to meet you")
