# Описание задания: Напишите программу, которая запрашивает у
# пользователя длину и ширину прямоугольника. После получения данных
# программа должна вычислить и вывести на экран площадь этого прямоугольника.

user_length = int(input("Enter the length of the triangle "))
user_width = int(input("Enter the width of the triangle "))
print(f"The area of a rectangle is {user_length * user_width}")
